{
    "onset": {
        "LongName": "onset of the trigger",
        "Units": "seconds (s) from the beginning of the recording"
        },
        "duration": {
            "LongName": "duration of the trigger",
            "Units": "seconds (s)"
        },
	"sample" : {
		"LongName" : "onset of the stimulus in units of time. In other words, onset in seconds multiplied by the sampling rate",
		"Units" : "No unit of measure. Starts at 1"
		},
        "trial_type": {
		"LongName" : "type of stimulus. Except for the first event that usually is <New segment> (an automatic trigger for the begninning of the record), all the others should be <Biphasic TMS pulse> indicating a TMS pulse"
		},
        },
        "value": {
	    "LongName" : "trigger code. Except for <New segment> it should always be S 132"
        },
    "nibs_type": {
		"Type" : "TMS",
		"Subtype" : "spTMS",
		"Description" : "single pulse TMS",
		"Manufacturer" : "Magventure",
		"DeviceModelName" : "MagPro X100",
		"DeviceSerialNumber" : "n/a",
		"CoilSpec" : {
			"CoilType" : "figure-of-eight",
			"CoilWingDiameter" : {
				"Value" : "70",
				"Unit" : "mm"
				},
			"CoilModelName" : "C-B60",
			"CoilSerialNumber" : "n/a"
			},
        "DeviceFirmware": "n/a",
        "SoftwareSpecification": {
            "ChargeDelay": "1 second"
        },
        "AuditoryMasking": "yes",
        "StimulationProcedure": "The sites of stimulation were determined individually for each subject using their resting–state functional network maps. As sham, we performed a block of stimulation positioning the coil on Cz, with a 3 cm spacer that prevented meaningful currents from being generated in the cortex (for the efficacy of the 3 cm distance, refer to Rossi et al.62). The individual structural MRI and the coordinates of the point of local maxima for each node were input to the SofTaxic Neuronavigation system (E.M.S., Bologna, Italy) to guide the positioning of the coil on the correct spot. The order of stimulation (l–ECN, r–ECN, l–DMN, r–DMN and sham) was counterbalanced across participants and groups. For each site, 80 biphasic TMS pulses were delivered with a random ISI between 1.5 and 3 seconds. The coil was oriented at 45° degrees with respect to the interhemispheric sulcus for the frontal site, with electrical current direction anterior-to-posterior and posterior-to-anterior (ap-pa, biphasic stimulus). For the parietal sites, the coil was oriented at approximately 10° with respect to the interhemispheric sulcus, with electrical current direction medial-to-lateral lateral–to–medial (ml-lm, biphasic stimulus). The stimulator was set to recharge with a delay of one second to prevent recharging artifacts on the EEG signal."
    },
    "nibs_stim_intensity": {
        "StimulationIntensity": {
            "Value": "110%",
            "Unit": "rMT",
            "UnitLongName": "stimulation was set at 110% of the rMT"
        },
		"InterStimulusInterval": {
                "Interval": "1.5-3",
                "Unit": "seconds"
            },
            "PulsesNumber": "Please add",
            "StimulationIntensityProcedire": "Please add"
        }},
}
